<h1>pandas Start Guide<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#pandas-Data-Structures" data-toc-modified-id="pandas-Data-Structures-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>pandas Data Structures</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Series</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-1.1.1"><span class="toc-item-num">1.1.1&nbsp;&nbsp;</span>Series</a></span></li><li><span><a href="#creating-Series-from-dict" data-toc-modified-id="creating-Series-from-dict-1.1.2"><span class="toc-item-num">1.1.2&nbsp;&nbsp;</span>creating Series from dict</a></span></li></ul></li><li><span><a href="#DataFrame" data-toc-modified-id="DataFrame-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>DataFrame</a></span><ul class="toc-item"><li><span><a href="#DataFrame" data-toc-modified-id="DataFrame-1.2.1"><span class="toc-item-num">1.2.1&nbsp;&nbsp;</span>DataFrame</a></span></li><li><span><a href="#add/modify/delete-columns-or-rows" data-toc-modified-id="add/modify/delete-columns-or-rows-1.2.2"><span class="toc-item-num">1.2.2&nbsp;&nbsp;</span>add/modify/delete columns or rows</a></span></li><li><span><a href="#transpose" data-toc-modified-id="transpose-1.2.3"><span class="toc-item-num">1.2.3&nbsp;&nbsp;</span>transpose</a></span></li></ul></li><li><span><a href="#Index-Objects" data-toc-modified-id="Index-Objects-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Index Objects</a></span><ul class="toc-item"><li><span><a href="#methods/attributes-of-Index" data-toc-modified-id="methods/attributes-of-Index-1.3.1"><span class="toc-item-num">1.3.1&nbsp;&nbsp;</span>methods/attributes of Index</a></span></li></ul></li></ul></li><li><span><a href="#Essential-Funcionality" data-toc-modified-id="Essential-Funcionality-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Essential Funcionality</a></span><ul class="toc-item"><li><span><a href="#Reindexing" data-toc-modified-id="Reindexing-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Reindexing</a></span></li><li><span><a href="#Dropping-Entries-from-an-Axis" data-toc-modified-id="Dropping-Entries-from-an-Axis-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Dropping Entries from an Axis</a></span></li><li><span><a href="#Indexing,-Selecting,-Filtering" data-toc-modified-id="Indexing,-Selecting,-Filtering-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Indexing, Selecting, Filtering</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-2.3.1"><span class="toc-item-num">2.3.1&nbsp;&nbsp;</span>Series</a></span></li><li><span><a href="#DataFrame" data-toc-modified-id="DataFrame-2.3.2"><span class="toc-item-num">2.3.2&nbsp;&nbsp;</span>DataFrame</a></span></li><li><span><a href="#selection-with-loc-&amp;-iloc" data-toc-modified-id="selection-with-loc-&amp;-iloc-2.3.3"><span class="toc-item-num">2.3.3&nbsp;&nbsp;</span>selection with loc &amp; iloc</a></span></li></ul></li><li><span><a href="#Function-Application-and-Mapping" data-toc-modified-id="Function-Application-and-Mapping-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>Function Application and Mapping</a></span></li><li><span><a href="#Sorting-and-Ranking" data-toc-modified-id="Sorting-and-Ranking-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>Sorting and Ranking</a></span><ul class="toc-item"><li><span><a href="#sorting-by-index" data-toc-modified-id="sorting-by-index-2.5.1"><span class="toc-item-num">2.5.1&nbsp;&nbsp;</span>sorting by index</a></span></li><li><span><a href="#sorting-by-values" data-toc-modified-id="sorting-by-values-2.5.2"><span class="toc-item-num">2.5.2&nbsp;&nbsp;</span>sorting by values</a></span></li><li><span><a href="#ranking" data-toc-modified-id="ranking-2.5.3"><span class="toc-item-num">2.5.3&nbsp;&nbsp;</span>ranking</a></span></li></ul></li></ul></li><li><span><a href="#Descriptive-Statistics" data-toc-modified-id="Descriptive-Statistics-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Descriptive Statistics</a></span><ul class="toc-item"><li><span><a href="#Descriptive-and-Summary-Statistics" data-toc-modified-id="Descriptive-and-Summary-Statistics-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Descriptive and Summary Statistics</a></span><ul class="toc-item"><li><span><a href="#list-of-functions" data-toc-modified-id="list-of-functions-3.1.1"><span class="toc-item-num">3.1.1&nbsp;&nbsp;</span>list of functions</a></span></li></ul></li><li><span><a href="#Correlation-and-Covariance" data-toc-modified-id="Correlation-and-Covariance-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Correlation and Covariance</a></span></li><li><span><a href="#Unique-Values,-Value-Counts,-and-Membership" data-toc-modified-id="Unique-Values,-Value-Counts,-and-Membership-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Unique Values, Value Counts, and Membership</a></span></li></ul></li></ul></div>

pandas is designed for working with **tabular** or **heterogeneous** data. <br/>
NumPy is best suited for working with homogeneous numerical (n-dimensional) arrays.

In [3]:
import pandas as pd
#from pandas import Series, DataFrame
pd.__version__

'0.20.3'

# pandas Data Structures
## Series
### Series
A Series is like a 1-dimensional array, but has an associated array of data labels, called its *index*.

In [4]:
s = pd.Series([30, 14, 'a', 56])  # default index: [0,1,2,...]
print(s)
print()
print('s.value:', s.values)  # get the values
print('s.index:', s.index)
print('s.size:', s.size)

0    30
1    14
2     a
3    56
dtype: object

s.value: [30 14 'a' 56]
s.index: RangeIndex(start=0, stop=4, step=1)
s.size: 4

In [5]:
# changing index (the element of index need not be distinct)
s.index = ['a', 'b', 'c', 'd']
s

a    30
b    14
c     a
d    56
dtype: object

In [6]:
# setting names of a Series and its index
s.name = 'my 1st pandas series'
s.index.name = 'id'
s

id
a    30
b    14
c     a
d    56
Name: my 1st pandas series, dtype: object

In [40]:
# specifying index on creation (the element of index need not be distinct)
s = pd.Series([30, -14, 7, 56], index=['a', 'b', 'c', 'c'])
print(s)
print()
print('s.index:', s.index)

a    30
b   -14
c     7
c    56
dtype: int64

s.index: Index(['a', 'b', 'c', 'c'], dtype='object')

In [16]:
# indexing
s = pd.Series([30, -14, 7, 56], index=['a', 'b', 'c', 'c'])
print(s)

s['a']  # 30

s['c']  # c  7 
        # c 56

s['a'] = 3

s1 = s[['a', 'b']] # a    3
              # b  -14
type(s1)    

# # indexing by location    
s.iloc[1]  # -14
#s[1]  # buggy?

# # slicing
s[0:1] # a   3  (a Series) (return a view)

a    30
b   -14
c     7
c    56
dtype: int64

a    3
dtype: int64

See [Indexing, Selecting, Filtering](#Indexing,-Selecting,-Filtering) for more on indexing.

In [140]:
# arithmetics and NumPy functions
import numpy as np
s = pd.Series([30, -14, 7, 56], index=['a', 'b', 'c', 'c'])

np.cos(s)
s * 2

s > 0  # a   True
       # b  False
       # c   True
       # c   True
    
s1 = s[[True,False,True,False]]  # returns a copy
s[s > 0]  # a  30
          # c   7
          # c  56

a    30
b   -14
c     7
c    56
dtype: int64

a    30
b   -14
c     7
c    56
dtype: int64

In [23]:
print(s)
'a' in s  # True

a    30
b   -14
c     7
c    56
dtype: int64

True

[練習] 
1. 請建立一個 index 為 `['a1','a2','a3','a4']`、值為亂數的 Series (設定到變數 `s`). 提示: 使用 `numpy.random.rand(4)`
2. 利用 `s` 產生另一個 Series，index 與 `s` 相同，但值為 `s` 值的平方
3. 印出 `s` 裡面 數值 > 0.5 的資料

In [31]:
s = pd.Series(np.random.rand(4), index=['a1','a2','a3','a4'])
s1 = s*s
s2 = s[s > 0.5]
s2

a1    0.664520
a2    0.978035
a3    0.849068
dtype: float64

### creating Series from dict

In [48]:
city_data = {'Taoyuan': 71, 'Taipei': 350, 'Hsinchu': 120, 'Taichung': 102, 'Tainan':137}
s1 = pd.Series(city_data)
s1

Hsinchu     120
Taichung    102
Tainan      137
Taipei      350
Taoyuan      71
dtype: int64

In [36]:
city_data = {'Taoyuan': 71, 'Taipei': 350, 'Hsinchu': 120, 'Taichung': 102, 'Tainan':137}
cities_index = ['Taipei', 'Taoyuan', 'Hsinchu', 'Miaoli', 'Taichung']
s2 = pd.Series(city_data, index=cities_index)
s2

# x = np.nan
# np.isnan(x)

Taipei      350.0
Taoyuan      71.0
Hsinchu     120.0
Miaoli        NaN
Taichung    102.0
dtype: float64

In [46]:
# missing values
s2.isnull()
pd.isnull(s2)  # same

s2.notnull()
pd.notnull(s2)  # same

Taipei       True
Taoyuan      True
Hsinchu      True
Miaoli      False
Taichung     True
dtype: bool

Exercise. Print the labels with missing value in a Series (such as `s2`).

In [44]:
s2[s2.isnull()]

Miaoli   NaN
dtype: float64

In [49]:
print('=== s1 ===\n', s1, sep='')
print('=== s2 ===\n', s2, sep='')

s1 + s2  # addition by label

=== s1 ===
Hsinchu     120
Taichung    102
Tainan      137
Taipei      350
Taoyuan      71
dtype: int64
=== s2 ===
Taipei      350.0
Taoyuan      71.0
Hsinchu     120.0
Miaoli        NaN
Taichung    102.0
dtype: float64

Hsinchu     240.0
Miaoli        NaN
Taichung    204.0
Tainan        NaN
Taipei      700.0
Taoyuan     142.0
dtype: float64

## DataFrame
### DataFrame
A DataFrame represents a rectangular table of data, where the columns can be of different data types.

In [51]:
frame = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
frame = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns=['A', 'B', 'C'], index=[101,102,103])
frame

     A  B  C
101  1  2  3
102  4  5  6
103  7  8  9

In [65]:
data_dict = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
             'year': [2000, 2001, 2002, 2001, 2002, 2003],
             'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data_dict)
frame = pd.DataFrame(data_dict, columns=['year', 'state', 'pop'])
frame = pd.DataFrame(data_dict, columns=['year', 'state', 'pop'], index=range(101,107))

frame
frame.head(4)  # show first 4 rows

###
frame2 = pd.DataFrame({'year':  {101: 2000,   102: 2001,   103: 2002,   104: 2001},
                       'state': {101: 'Ohio', 102: 'Ohio', 103: 'Ohio', 104: 'Nevada'},
                       'pop':   {101: 1.5,    102: 1.7,                 104: 2.4}
                      },
                      columns=['year', 'state', 'pop'])
frame2

###
frame3 = pd.DataFrame({'year': frame['year'],
                       'state': frame['state'], 
                       'pop': frame['pop'][1:-1]
                      },
                      columns=['year', 'state', 'pop'])
frame3

     year   state  pop
101  2000    Ohio  NaN
102  2001    Ohio  1.7
103  2002    Ohio  3.6
104  2001  Nevada  2.4
105  2002  Nevada  2.9
106  2003  Nevada  NaN

In [76]:
# set index name and column name
frame.index.name = 'id'
frame.columns.name = 'col_name'
frame

col_name  year   state  pop
id
101       2000    Ohio  1.5
102       2001    Ohio  1.7
103       2002    Ohio  3.6
104       2001  Nevada  2.4
105       2002  Nevada  2.9
106       2003  Nevada  3.2

In [11]:
frame.columns  # get the column Index (as a view/reference)

Index(['year', 'state', 'pop'], dtype='object', name='col_name')

In [60]:
frame.values  # get all values

array([[2000, 'Ohio', 1.5],
       [2001, 'Ohio', 1.7],
       [2002, 'Ohio', 3.6],
       [2001, 'Nevada', 2.4],
       [2002, 'Nevada', 2.9],
       [2003, 'Nevada', 3.2]], dtype=object)

In [68]:
# get data in specific column
frame['year']  # return a Series
frame.year  # this works only if the column label is a valid Python variable name

frame[['year','pop']]

     year  pop
101  2000  1.5
102  2001  1.7
103  2002  3.6
104  2001  2.4
105  2002  2.9
106  2003  3.2

In [72]:
# get specific row(s)
s = frame.loc[101]  # return the row with index = 101, as a Series
print(s)

frame.loc[[101]]  # return the row with index = 101, as a DataFrame
frame.loc[[101, 104]]  # return the row with specified index values, as a DataFrame

year     2000
state    Ohio
pop       1.5
Name: 101, dtype: object

     year   state  pop
101  2000    Ohio  1.5
104  2001  Nevada  2.4

In [75]:
# get subset of DataFrame
frame.loc[101, 'year']
frame.loc[[101, 106], 'year']  # return data in the specified rows and column, as a Series
frame.loc[[101, 106], ['year']]  # return the specified rows and column, as a DataFrame
frame.loc[[101, 106], ['year','state']]  # return the specified rows and columns, as a DataFrame

     year   state
101  2000    Ohio
106  2003  Nevada

See [Indexing, Selecting, Filtering](#Indexing,-Selecting,-Filtering) for more on indexing.

In [98]:
# [練習] 執行下列程式碼
school_table = pd.DataFrame({'city_id': {'NTU':100, 'NCU':200, 'NTHU':300, 'NCKU':600}})
print('==== school_table ====')
print(school_table)

city_table = pd.DataFrame({'city_name': {100:'Taipei', 200:'Taoyuan', 300:'Hsinchu', 600:'Tainan'}})
city_table.index.name = 'city_id'
print('==== city_table ====')
print(city_table)

# 試利用 `school_table` 及 `city_table` 兩個 DataFrame 找出 `NCU` 所對應的 city name. 
arr = school_table.loc['NCU'].values
city_table.loc[arr]

==== school_table ====
      city_id
NCKU      600
NCU       200
NTHU      300
NTU       100
==== city_table ====
        city_name
city_id
100        Taipei
200       Taoyuan
300       Hsinchu
600        Tainan

        city_name
city_id
200       Taoyuan

### add/modify/delete columns or rows

In [87]:
import numpy as np

frame['debt'] = np.nan  # column 'debt' will be created if not already exists

frame['debt'] = [1.1, 1.2, 1.3, 0.7, 0.8, 0.9]

debt_series = pd.Series([1.1, 1.2, 0.7, 0.8], index=[101, 102, 104, 115], name='debt')
print(debt_series)
frame['debt'] = debt_series

frame

101    1.1
102    1.2
104    0.7
115    0.8
Name: debt, dtype: float64

     year   state  pop  debt
101  2000    Ohio  1.5   1.1
102  2001    Ohio  1.7   1.2
103  2002    Ohio  3.6   NaN
104  2001  Nevada  2.4   0.7
105  2002  Nevada  2.9   NaN
106  2003  Nevada  3.2   NaN

In [90]:
frame1 = frame.copy()
print(frame1)

frame1.loc[107] = [2000, 'Texas', 3.1, 0.5]   # row 107 will be created if not already exists
frame1.loc[108, 'A'] = 100   # row and column will be created if not already exists

frame1.drop(107, inplace=True)  # drop a row in-place

frame1

     year   state  pop  debt
101  2000    Ohio  1.5   1.1
102  2001    Ohio  1.7   1.2
103  2002    Ohio  3.6   NaN
104  2001  Nevada  2.4   0.7
105  2002  Nevada  2.9   NaN
106  2003  Nevada  3.2   NaN

       year   state  pop  debt      A
101  2000.0    Ohio  1.5   1.1    NaN
102  2001.0    Ohio  1.7   1.2    NaN
103  2002.0    Ohio  3.6   NaN    NaN
104  2001.0  Nevada  2.4   0.7    NaN
105  2002.0  Nevada  2.9   NaN    NaN
106  2003.0  Nevada  3.2   NaN    NaN
108     NaN     NaN  NaN   NaN  100.0

In [92]:
frame['is_eastern'] = (frame.state == 'Ohio')
del frame['is_eastern']  # delete column in-place

frame.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

See also: [Dropping Entries from an Axis](#Dropping-Entries-from-an-Axis).

In [94]:
frame1 = frame.copy()
print(frame1)
frame1.loc[103, 'debt'] = 1.3
frame1.loc[[105, 106], 'debt'] = [0.8, 0.9]
frame1

     year   state  pop  debt
101  2000    Ohio  1.5   1.1
102  2001    Ohio  1.7   1.2
103  2002    Ohio  3.6   NaN
104  2001  Nevada  2.4   0.7
105  2002  Nevada  2.9   NaN
106  2003  Nevada  3.2   NaN

     year   state  pop  debt
101  2000    Ohio  1.5   1.1
102  2001    Ohio  1.7   1.2
103  2002    Ohio  3.6   1.3
104  2001  Nevada  2.4   0.7
105  2002  Nevada  2.9   0.8
106  2003  Nevada  3.2   0.9

In [99]:
# [練習] 利用前一個練習的 school_table 和 city_table
# 1. 請對 school_table 新增一筆資料: NCTU, city_id: 300
# 2. 請把 Hsinchu, NTHU, NCTU 的 city_id 改成 301

print('==== school_table ====')
print(school_table)

print('==== city_table ====')
print(city_table)

school_table.loc['NCKU'] = 900
school_table

==== school_table ====
      city_id
NCKU      600
NCU       200
NTHU      300
NTU       100
==== city_table ====
        city_name
city_id
100        Taipei
200       Taoyuan
300       Hsinchu
600        Tainan

      city_id
NCKU      900
NCU       200
NTHU      300
NTU       100

In [107]:
s = pd.Series([1,2,np.nan,4])

s.dropna()
s.fillna(-1)

0    1.0
1    2.0
2   -1.0
3    4.0
dtype: float64

### transpose

In [109]:
print(frame)
frame2 = frame.T  # return a new DataFrame
frame2

     year   state  pop  debt
101  2000    Ohio  1.5   1.1
102  2001    Ohio  1.7   1.2
103  2002    Ohio  3.6   NaN
104  2001  Nevada  2.4   0.7
105  2002  Nevada  2.9   NaN
106  2003  Nevada  3.2   NaN

        101   102   103     104     105     106
year   2000  2001  2002    2001    2002    2003
state  Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
pop     1.5   1.7   3.6     2.4     2.9     3.2
debt    1.1   1.2   NaN     0.7     NaN     NaN

## Index Objects

In [111]:
ind = pd.Index(['a', 'b', 'c', 'a'])  # an Index object (can contain duplicate elements)
s = pd.Series(range(4), index=ind)

ind[0]  # 'a'
ind[0:2]  # Index(['a', 'b'], dtype='object')
#ind[1] = 'B'  # error. Index objects are immutable.

'c' in ind  # True

ind.values

# selection with duplicate index elements will select all occurrences:
s['a']  # a  0
        # a  3

a    0
a    3
dtype: int64

*Note*. Index objects are immutable.

### methods/attributes of Index

In [115]:
ind = pd.Index(['a', 'b', 'c'])
ind2 = pd.Index(['x', 'y', 'a'])

# each of the following methods returns a new Index
ind.append(ind2)  
ind.insert(1, 'aa')  # insert at position 1

ind.delete(2)
ind.drop('a')

ind.union(ind2)
ind.intersection(ind2)
ind.difference(ind2)

#
#print(ind)
ind.isin(['c', 'd', 'e'])  # returns an array
ind.is_monotonic  # True
ind.is_unique  # are elements unique?

#
ind = pd.Index(['a', 'b', 'c', 'c'])
ind.is_unique  # False
ind.unique()  # returns a new Index containing unique elements

Index(['a', 'b', 'c'], dtype='object')

# Essential Funcionality
## Reindexing
* Reindexing Series:

In [116]:
s = pd.Series([4.2, -1.6, 6.3], index=['a', 'x', 'c'])
s

a    4.2
x   -1.6
c    6.3
dtype: float64

In [122]:
s1 = s.reindex(['a', 'b', 'c'])  # reindexing, creating new Series (the index of `s` must have unique labels)
# s1 = s.reindex(['a', 'b', 'c'], method='ffill') ????
s1

a   NaN
b   NaN
c   NaN
dtype: float64

In [120]:
# reindexing with filling
s = pd.Series([10, 12, 14], index=[0, 2, 4])
print(s)
s1 = s.reindex([0,1,2,3,4], method='ffill')  # forward filling
s1

0    10
2    12
4    14
dtype: int64

0    10
1    10
2    12
3    12
4    14
dtype: int64

* Reindxing DataFrame:

In [44]:
import numpy as np
frame = pd.DataFrame(np.arange(9).reshape(3,3),
                     index=['a','c','d'],
                     columns=['Ohio', 'Texas','California'])
print(frame)
frame2 = frame.reindex(index=['a','b','c','d'])  # reindexing rows
frame2

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [110]:
frame2 = frame.reindex(columns=['Texas','Utah','California'])  # reindexing columns
frame2

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

[練習] 試試看 reindex 時，同時指定想要選取的 rows 和 columns

## Dropping Entries from an Axis

In [135]:
s = pd.Series(np.arange(0.0,2.01), index=['a','b','c'])
print(s)

s1 = s.drop('b')
s1.drop('a', inplace=True)  # modifying in-place. Use with care!

a    0.0
b    1.0
c    2.0
dtype: float64

In [48]:
frame = pd.DataFrame(np.arange(9).reshape(3,3),
                     index=['a','c','d'],
                     columns=['Ohio', 'Texas','California'])
print(frame)

frame2 = frame.drop('d')  # drop a row
frame2 = frame.drop(['c','d'])  # drop rows

frame2 = frame.drop('Texas', axis=1)  # drop a column

frame2.drop('a', inplace=True)  # modifying in-place. Use with care!

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

## Indexing, Selecting, Filtering
### Series

In [61]:
# Series indexing
s = pd.Series(np.arange(0.5,3.51), index=['a','b','d','c'])
print(s)

v = s['a']  # 0.5
v = s[1]  # 1.5  (buggy?)
v = s.iloc[1]  # 1.5

s1 = s[['c','d']]   # c  3.5
                    # d  2.5
s1 = s[s < 2.0]  # a  0.5
                 # b  1.5

# slicing with position    
s1 = s[2:4]  # d  2.5  # returns a view
             # c  3.5
    
# slicing with index values (Note. Endpoint is inclusive!)
s1 = s['b':'c']  # b   1.5   # returns a view
                 # d   2.5
                 # c   3.5

a    0.5
b    1.5
d    2.5
c    3.5
dtype: float64

In [62]:
s = pd.Series(np.arange(0.5,3.51), index=[1,2,3,4])
print(s)

v = s[2]  # 1.5  # 2 interpreted as labels
v = s.iloc[2]

s1 = s[[2,3]] # 2  1.5  # [2,3] interpreted as labels
              # 3  2.5

s1 = s[2:4]  # 3  2.5  # [2:4] interpreted as positions
             # 4  3.5

1    0.5
2    1.5
3    2.5
4    3.5
dtype: float64
1.5

*Notes*. 
* slicing with integers: by position, even if the labels are integers
* slicing with non-numeric labels: by labels, endpoint included

In [127]:
# setting with selection
s = pd.Series(np.arange(0.5,2.51), index=['a','e','x'])
print(s)
print('')

s['a','e'] = [-1, -2]
s['a','e'] = pd.Series({'a':-1, 'e':-2})
print(s)
print('')

s[s < 0] = 0
print(s)

a    0.5
e    1.5
x    2.5
dtype: float64

a   -1.0
e    NaN
x    2.5
dtype: float64

a    0.0
e    NaN
x    2.5
dtype: float64

### DataFrame

In [92]:
frame = pd.DataFrame(np.arange(0.0,8.01).reshape(3,3),
                     columns=['one','two','three'],
                     index=['Colorado', 'Texas','California'])
frame

            one  two  three
Colorado    0.0  1.0    2.0
Texas       3.0  4.0    5.0
California  6.0  7.0    8.0

In [97]:
# select columns
frame['one']  # select a column
frame[['two','three']]  # select columns

# select rows
frame[0:2]  # select rows
frame[frame['one'] > 1.0]  # select rows

frame.loc['Colorado']  # select a row
frame.loc[['Colorado', 'Texas']]  # select rows
frame.iloc[0:2]
frame.loc[frame['one'] > 1.0]

# select rows and columns
frame.loc[['Colorado', 'Texas'], ['one','two']]  # select by rows and columns

            one  two  three
Texas       3.0  4.0    5.0
California  6.0  7.0    8.0

In [37]:
frame[frame < 3.0] = 3.0
frame

            one  two  three
Colorado    3.0  3.0    3.0
Texas       3.0  4.0    5.0
California  6.0  7.0    8.0

### selection with loc & iloc

In [ ]:
s = pd.Series([0.5,1.5,2.5], index=['a','e','x'])
print(s)

s.loc['a']  # 0.5
s.iloc[0]  # same

s.loc['e':'x']  # e  1.5   # 'x' included
                # x  2.5  
s.iloc[1:3]  # position 3 is NOT included

In [44]:
frame = pd.DataFrame(np.arange(0.0,8.01).reshape(3,3),
                     columns=['one','two','three'],
                     index=['Colorado', 'Texas','California'])
frame

            one  two  three
Colorado    0.0  1.0    2.0
Texas       3.0  4.0    5.0
California  6.0  7.0    8.0

In [98]:
frame.loc['Colorado', ['one', 'two']]
frame.iloc[0, [0,1]]

one    0.0
two    1.0
Name: Colorado, dtype: float64

In [100]:
frame.loc['California', 'one':'three']  # 'two' is included
frame.iloc[0, :3]  # position 3 is NOT included

one      0.0
two      1.0
three    2.0
Name: Colorado, dtype: float64

In [126]:
# [練習]
s = pd.Series(np.rint(np.random.rand(10)*100)*1000, index=range(101,111))
s.name = 'salary'
s.index.name = 'emp_id'
print(s)

ids = [103,104,107,109]
# 請建立另一個 Series, 與 `s` 相同，但 emp_id 被包含在 ids 裡的資料數值 被加上 500

s1 = s.copy()
s1[ids] = s[ids] + 500
s1

emp_id
101    41000.0
102    48000.0
103    13000.0
104    41000.0
105    82000.0
106    34000.0
107    69000.0
108    58000.0
109     8000.0
110    19000.0
Name: salary, dtype: float64

emp_id
101    41000.0
102    48000.0
103    13500.0
104    41500.0
105    82000.0
106    34000.0
107    69500.0
108    58000.0
109     8500.0
110    19000.0
Name: salary, dtype: float64

## Function Application and Mapping

In [127]:
# using NumPy ufuncs (element-wise array methods)
frame = pd.DataFrame(np.round(np.random.randn(3,3), 2),
                     columns=['one','two','three'],
                     index=['Colorado', 'Texas','California'])
print(frame)

np.fabs(frame)

             one   two  three
Colorado    1.21 -0.87  -1.31
Texas      -0.06 -0.02   0.93
California  0.48 -0.87   0.70

             one   two  three
Colorado    1.21  0.87   1.31
Texas       0.06  0.02   0.93
California  0.48  0.87   0.70

In [129]:
# statistic functions
frame.sum()  # get sum of every column
frame.sum(axis='columns')  # get sum of every row

frame.mean()  # get mean of every column

one      0.543333
two     -0.586667
three    0.106667
dtype: float64

In [130]:
# apply() of Series
func = lambda x: '~' + str(x)  # `func` takes a scalar
s.apply(func)  # apply `func` element-wise

emp_id
101    ~41000.0
102    ~48000.0
103    ~13000.0
104    ~41000.0
105    ~82000.0
106    ~34000.0
107    ~69000.0
108    ~58000.0
109     ~8000.0
110    ~19000.0
Name: salary, dtype: object

In [132]:
# apply() of DataFrame
func = lambda arr1d: arr1d.max() - arr1d.min()  # `func` takes one 1D array

columns_data = frame.apply(func)  # apply `func` on every column
print(columns_data)
print('')

row_data = frame.apply(func, axis='columns')  # apply `func` on every row
print(row_data)

one      1.27
two      0.85
three    2.24
dtype: float64

Colorado      2.52
Texas         0.99
California    1.57
dtype: float64

In [133]:
def func(arr1d):  # takes one 1D array; returns a Series
    return pd.Series([arr1d.min(), arr1d.max()], index=['min', 'max'])
frame.apply(func)

      one   two  three
min -0.06 -0.87  -1.31
max  1.21 -0.02   0.93

In [134]:
func = lambda x: '{:.1f}'.format(x)  

frame.applymap(func)  # apply `func` on every entry
#func(frame)  # won't work, or doesn't make sense

             one   two three
Colorado     1.2  -0.9  -1.3
Texas       -0.1  -0.0   0.9
California   0.5  -0.9   0.7

In [135]:
# [練習]
import math
table = pd.DataFrame({'Math': np.random.uniform(0,100,10),
                      'English': np.random.uniform(0,100,10),
                      'Physics': np.random.uniform(0,100,10)})
table.index.name = 'student_id'
print(table)

# 1. 將成績 開根號乘以 10, 然後四捨五入取整數
# 2. 建立一個表格，內容為每個科目 小於 60 分的人數 和 90 分以上的人數

              English       Math    Physics
student_id
0           96.580628   1.229872  69.408825
1           41.475066  85.047163  44.003750
2           58.444461  40.079175  66.439001
3           52.362040  23.266839  76.134475
4           11.504513  76.653167  17.506123
5           81.033897  21.657941  47.413577
6           97.829821  34.516018  86.618946
7           64.660250  39.269891  90.054321
8           98.789563  90.800932   5.818763
9            0.005036   8.289476  77.460754

## Sorting and Ranking
### sorting by index

In [105]:
s = pd.Series(range(4), index=['b','d','a','c'])
s.sort_index()  # sort by index (lexicographically)
                # returns a new Series

a    2
b    0
c    3
d    1
dtype: int64

In [116]:
frame = pd.DataFrame(np.arange(8).reshape(2,4), index=['three','one'], columns=['C','A','D','B'])
print(frame)
print('')

frame2 = frame.sort_index()  # sort by (row) index
print(frame2)
print('')

frame2 = frame.sort_index(axis=1, ascending=False)  # sort by column labels, in descending order
print(frame2)

       C  A  D  B
three  0  1  2  3
one    4  5  6  7

       C  A  D  B
one    4  5  6  7
three  0  1  2  3

       D  C  B  A
three  2  0  3  1
one    6  4  7  5

### sorting by values

In [121]:
s = pd.Series([1, 9, -3, np.nan, 2])
s.sort_values()  # missing values will be at the end

2   -3.0
0    1.0
4    2.0
1    9.0
3    NaN
dtype: float64

In [127]:
frame = pd.DataFrame({'a':[0,1,0,0,1], 'b':[1,9,-3,np.nan,2]})
print(frame)
print('')

frame2 = frame.sort_values(by='b')
print(frame2)
print('')

frame2 = frame.sort_values(by=['a','b'])
print(frame2)
print('')

   a    b
0  0  1.0
1  1  9.0
2  0 -3.0
3  0  NaN
4  1  2.0

   a    b
2  0 -3.0
0  0  1.0
4  1  2.0
1  1  9.0
3  0  NaN

   a    b
2  0 -3.0
0  0  1.0
3  0  NaN
4  1  2.0
1  1  9.0

### ranking

In [184]:
s = pd.Series([3,5,4,2], index=['a','b','c','d'])
print('=== s ===')
print(s)
print('')

ranks = s.rank()  # ascending order (gives rank 1.0 to smallest value)
ranks = s.rank(ascending=False)  # descending order (gives rank 1.0 to largest value)
# result:
#  0  (rank of s[0])
#  1  (rank of s[1])
#  2  (rank of s[2])
#  ...
# The rank starts from 1.0 .

print('=== s.rank(), descending ===')
print(ranks)

=== s ===
a    3
b    5
c    4
d    2
dtype: int64

=== s.rank(), descending ===
a    3.0
b    1.0
c    2.0
d    4.0
dtype: float64

In [185]:
s = pd.Series([1,2,2,3], index=['a','b','c','d'])  # with tie/duplicate values
s.rank()

a    1.0
b    2.5
c    2.5
d    4.0
dtype: float64

In [186]:
s.rank(method='first')

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [187]:
s.rank(method='max')

a    1.0
b    3.0
c    3.0
d    4.0
dtype: float64

In [188]:
s.rank(method='dense')

a    1.0
b    2.0
c    2.0
d    3.0
dtype: float64

In [191]:
frame = pd.DataFrame({'a':[0,1,0,1], 'b':[1,9,-3,2], 'c':[0.5,3.2,-1.1,8.3]})
print('=== frame ===')
print(frame)
print('')

ranks = frame.rank(method='first')  # gives the rank of every entry among its column
print('=== frame.rank() ===')
print(ranks)
print('')

ranks = frame.rank(axis='columns', method='first')  # gives the rank of every entry among its row
print('=== frame.rank(axis=\'columns\') ===')
print(ranks)

=== frame ===
   a  b    c
0  0  1  0.5
1  1  9  3.2
2  0 -3 -1.1
3  1  2  8.3

=== frame.rank() ===
     a    b    c
0  1.0  2.0  2.0
1  3.0  4.0  3.0
2  2.0  1.0  1.0
3  4.0  3.0  4.0

=== frame.rank(axis='columns') ===
     a    b    c
0  1.0  3.0  2.0
1  1.0  3.0  2.0
2  3.0  1.0  2.0
3  1.0  2.0  3.0

In [251]:
# [練習]
import math
table = pd.DataFrame({'Math': np.random.normal(70,25,10),
                      'English': np.random.normal(70,25,10),
                      'Physics': np.random.normal(70,25,10)})
table[table < 0] = 0
table[table > 100] = 100
table.index.name = 'student_id'
print(table)

# 1. 找出所有學生中，有任何科目成績排名前三名者
# 2. 請建立一個表格，列出每科目成績前三名的學生 id (columns: 科目，rows: 名次)

               English        Math     Physics
student_id
0            43.443660   80.444053   62.483010
1             0.000000   79.792017   63.326233
2            85.457401   60.760412   70.812782
3             0.546902   99.614017   64.892723
4            46.854878  100.000000   39.721650
5            73.814788   77.375491   46.062813
6            55.298586   46.726975   51.051553
7            86.515266   89.843610   40.810520
8           100.000000   79.470056   49.528202
9            65.001213   93.684524  100.000000

# Descriptive Statistics
pandas objects are equipped with a set of common mathematical and statistical methods. Compared with the similar methods on NumPy arrays, they have built-in handling for missing data.
## Descriptive and Summary Statistics

In [30]:
frame = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
                     index=['a','b','c','d'],
                     columns=['one','two'])
frame

one    3
two    2
dtype: int64

In [21]:
frame.sum()  # computes sums within each column

one    9.25
two   -5.80
dtype: float64

In [23]:
frame.sum(skipna=False)  # does not skip missing values

one   NaN
two   NaN
dtype: float64

In [22]:
frame.sum(axis='columns')  # computes sums within each row

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [32]:
frame.count()  # count of non-NA values

one    3
two    2
dtype: int64

In [24]:
frame.idxmax()  # indexes of maximum, for each column

one    b
two    d
dtype: object

In [26]:
frame.cumsum()  # accumulation

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [27]:
# describe()
frame.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [29]:
# describe() on non-numeric data
s = pd.Series(['a','a','b','c']*3)
s.describe()

count     12
unique     3
top        a
freq       6
dtype: object

### list of functions
* `describe`
* `count`
* `min, max`
* `argmin, argmax, idxmin, idxmax`
* `median, quantile`
* `sum, mean`
* `prod` (product)
* `var, std`
* `skew, kurt`
* `cumsum` (cumulative sum), `cummin, cummax, cumprod`
* `diff` (difference from previous element), `pct_change` (percent changes)

## Correlation and Covariance

In [ ]:
s1 = pd.Series([0,3,4,7,10])
s2 = pd.Series([-3,2,4,5,7])

s1.corr(s2)  # 0.9418029136320045  # correlation between `s1` and `s2`
s1.cov(s2)  # 13.75  # covariance between `s1` and `s2`

In [50]:
s3 = pd.Series([-3,-2,-5,-7,-9])
frame = pd.DataFrame({'A': s1, 'B': s2, 'C': s3})
print(frame)

frame.cov()  # covariance matrix between the columns
frame.corr()  # correlation matrix between the columns

    A  B  C
0   0 -3 -3
1   3  2 -2
2   4  4 -5
3   7  5 -7
4  10  7 -9

          A         B         C
A  1.000000  0.941803 -0.915378
B  0.941803  1.000000 -0.802448
C -0.915378 -0.802448  1.000000

## Unique Values, Value Counts, and Membership

In [76]:
s = pd.Series(['c','d','a','a','b','b','c','c'])

#
unique_values_arr = s.unique()  # ['c', 'd', 'a', 'b']   # unique values
pd.unique(s)  # same

#
s.value_counts()  # c   3   # histogram / frequency table
                  # b   2
                  # a   2
                  # d   1
pd.value_counts(s)  # same
 
#
mask = s.isin(['b','c'])
s[mask]  # 0   c
         # 4   b
         # 5   b
         # 6   c
         # 7   c
        
#
ind = pd.Index(['a','b'])
a = ind.get_indexer(s)  # [-1, -1,  0,  0,  1,  1, -1, -1]  # `ind` must have unique labels
  # a[i] is such that s[0] = ind[a[i]]
  # a[j] = -1 means s[j] is not in `ind`

array(['c', 'd', 'a', 'b'], dtype=object)

In [79]:
# Example: histograms of columns of DataFrame
frame = pd.DataFrame({'A':[1,3,4,3,4], 'B':[2,3,1,3,3], 'C':[1,5,2,4,4]})

frame.apply(pd.value_counts)
frame.apply(pd.value_counts).fillna(0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  1.0  1.0
3  2.0  3.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0